trunk/app/controllers/comments_controller.rb

  def destroy
    if current_user && current_user.privilege > 1
      @comment = Comment.find(params[:id])
      @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 10)
DELETE FROM `comments` WHERE `id` = 10

  def movie
    the_movie = Movie.find_by_id params[:id]
    if the_movie
      comments = Comment.find :all, :conditions => {:movie_id => the_movie.id}
---
SELECT * FROM `movies` WHERE (`movies`.`id` = '1') LIMIT 1
SELECT * FROM `comments` WHERE (`comments`.`movie_id` = '1')

  def xpost
    puts "------------------------------------------------------------\n\n"
    begin
      comment = Comment.new params[:comment]
      user = User.find session[:user_id]
      movie = Movie.find comment.movie_id
      raise if (comment.content =~ /^\s*$/) != nil

      comment.user_id = user.id
      comment.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)
INSERT INTO `comments` (`updated_at`, `movie_id`, `content`, `user_id`, `created_at`) VALUES('2009-06-24 13:09:32', 2, 'how to say fuck', 2, '2009-06-24 13:09:32')