trunk/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`updated_at`, `movie_id`, `content`, `user_id`, `created_at`) VALUES('2009-06-22 16:55:18', 1, 'Holy shit!', 1, '2009-06-22 16:55:18')