trunk/app/controllers/login_controller.rb

  def loginfo
    curr_user = User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1