trunk/app/controllers/movies_controller.rb

SELECT * FROM `movies`
---
  def index
    @movies = Movie.all

SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
---
  def edit
    @movie = Movie.find(params[:id])

SELECT * FROM `movies` WHERE (`movies`.`id` = 7)
DELETE FROM `movies` WHERE `id` = 7
---
  def destroy
    if current_user && current_user.privilege > 1
      @movie = Movie.find(params[:id])
      File.delete @movie.path

SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
---
  def stream
    begin
      @movie = Movie.find(params[:id])

INSERT INTO `movies` (`updated_at`, `title`, `tags`, `info`, `user_id`, `path`, `created_at`) VALUES('2009-06-24 19:15:39', 'erase.scm', '', '', NULL, '/home/zhangqi/ror/hhac2/public/upload/20090625031539_erase.scm', '2009-06-24 19:15:39')
---
  def save
    if current_user
      begin
        movie = Movie.new params[:movie]
        raise "Title cannot be empty." if (movie.title =~ /^\s*$/) != nil

        file = params[:file]  # Tempfile实例
        raise "File was not uploaded." if file == nil

        begin
          fname = Time.now.strftime("%Y%m%d%H%M%S")+"_"+file.original_filename
          f = File.new "#{RAILS_ROOT}/public/upload/#{fname}", 'wb'
          f.write file.read

          movie.path = f.path
          movie.user_id = current_user.id
          movie.save

SELECT * FROM `movies` WHERE (`movies`.`id` = '1') LIMIT 1
---
  def info
    @movie = Movie.find_by_id params[:id]