trunk/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`uname`, `passwd`, `updated_at`, `utype`, `email`, `created_at`) VALUES('physacco', 'physacco', '2009-06-22 16:36:27', NULL, 'physacco@gmail.com', '2009-06-22 16:36:27')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 7) LIMIT 1
UPDATE `users` SET `utype` = 'administrator', `updated_at` = '2009-06-22 16:36:39' WHERE `id` = 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
DELETE FROM `users` WHERE `id` = 4